{
  "_name_or_path": "",
  "architectures": [
    "BiomedCLIPModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_biomed_clip.BiomedCLIPConfig",
    "AutoProcessor": "processing_biomed_clip.BiomedCLIPProcessor",
    "AutoModel": "modeling_biomed_clip.BiomedCLIPModel",
    "AutoModelForImageClassification": "modeling_biomed_clip.BiomedCLIPForImageClassification"
  },
  "initializer_factor": 1.0,
  "logit_scale_init_value": 4.4454,
  "model_type": "clip",
  "projection_dim": 512,
  "text_config": {
    "attention_probs_dropout_prob": 0.1,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "transformers_version": "4.6.0.dev0",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 30522
  },
  "text_config_dict": {
    "attention_probs_dropout_prob": 0.1,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "transformers_version": "4.6.0.dev0",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 30522
  },
  "text_projection_config": {
    "hidden_size": 768,
    "intermediate_size": 640,
    "projection_dim": 512,
    "hidden_act": "gelu"
  },
  "text_projection_config_dict": {
    "hidden_size": 768,
    "intermediate_size": 640,
    "projection_dim": 512,
    "hidden_act": "gelu",
    "num_hidden_layers": 2
  },
  "torch_dtype": "float32",
  "transformers_version": null,
  "vision_config": {
    "attention_probs_dropout_prob": 0.0,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "image_size": 224,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "model_type": "vit",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "qkv_bias": true
  },
  "vision_config_dict": {
    "attention_probs_dropout_prob": 0.0,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "image_size": 224,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "model_type": "vit",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "qkv_bias": true
  }
}
